Revit 2024 API
FabricationPart.MaterialThickness Property
 The material thickness of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double MaterialThickness { get; }
Visual Basic
Public ReadOnly Property MaterialThickness As Double
	Get
Visual C++
public:
property double MaterialThickness {
	double get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace